package jp.jasminesoft.gcat.scalc;

import java.util.Hashtable;

/**
 * メッシュパラメタ
 */
public class MeshParameter {
	/**
	 * メッシュ番号と座標との対応表
	 */
	protected static Hashtable<Integer, MeshInfo> map = new Hashtable<Integer, MeshInfo>();
	static {
		map.put(new Integer(4128), new MeshInfo(4128, "徳之島", 1, -627162.364, -148418.339,
				-554092.714, -49170.555));
		map.put(new Integer(4129), new MeshInfo(4129, "徳之島", 1, -627955.448, -49469.854,
				-554092.714, 49170.555));
		map.put(new Integer(4229), new MeshInfo(4229, "奄美大島", 1, -554092.714, -49170.555,
				-480222.891, 48864.604));
		map.put(new Integer(4230), new MeshInfo(4230, "奄美大島", 1, -554092.714, 49170.555,
				-479404.462, 146601.905));
		map.put(new Integer(4328), new MeshInfo(4328, "宝島", 1, -479404.462, -146601.905,
				-406345.868, -48552.042));
		map.put(new Integer(4329), new MeshInfo(4329, "宝島", 1, -480222.891, -48864.604,
				-406345.868, 48552.042));
		map.put(new Integer(4429), new MeshInfo(4429, "中之島", 1, -406345.868, -48552.042,
				-332461.539, 48232.908));
		map.put(new Integer(4529), new MeshInfo(4529, "中之島", 1, -332461.539, -48232.908,
				-258569.801, 47907.244));
		map.put(new Integer(4629), new MeshInfo(4629, "黒島", 1, -258569.801, -47907.244,
				-184670.555, 47575.093));
		map.put(new Integer(4728), new MeshInfo(4728, "富江", 1, -183806.790, -142731.986,
				-110763.705, -47236.498));
		map.put(new Integer(4729), new MeshInfo(4729, "甑島", 1, -184670.555, -47575.093,
				-110763.705, 47236.498));
		map.put(new Integer(4828), new MeshInfo(4828, "富江", 1, -109889.760, -141715.852,
				-36849.163, -46891.503));
		map.put(new Integer(4829), new MeshInfo(4829, "野母崎", 1, -110763.705, -47236.498,
				-36849.163, 46891.503));
		map.put(new Integer(4928), new MeshInfo(4928, "福江", 1, -35965.508, -140680.518, 37073.160,
				-46540.153));
		map.put(new Integer(4929), new MeshInfo(4929, "長崎", 1, -36849.163, -46891.503, 37073.160,
				46540.153));
		map.put(new Integer(5029), new MeshInfo(5029, "唐津", 1, 37073.160, -46540.153, 111003.345,
				46182.493));
		map.put(new Integer(5129), new MeshInfo(5129, "厳原", 1, 111003.345, -46182.493, 184941.471,
				45818.571));
		map.put(new Integer(5229), new MeshInfo(5229, "厳原", 1, 184941.471, -45818.571, 258887.612,
				45448.433));
		map.put(new Integer(4530), new MeshInfo(4530, "屋久島", 2, -332145.822, -96467.666,
				-258676.419, 0.000));
		map.put(new Integer(4531), new MeshInfo(4531, "屋久島", 2, -332566.769, 0.000, -258249.918,
				95816.252));
		map.put(new Integer(4630), new MeshInfo(4630, "開聞岳", 2, -258249.918, -95816.252,
				-184778.504, 0.000));
		map.put(new Integer(4631), new MeshInfo(4631, "開聞岳", 2, -258676.419, 0.000, -184346.678,
				95151.863));
		map.put(new Integer(4730), new MeshInfo(4730, "鹿児島", 2, -184346.678, -95151.863,
				-110872.928, 0.000));
		map.put(new Integer(4731), new MeshInfo(4731, "宮崎", 2, -184778.504, 0.000, -110436.011,
				94474.586));
		map.put(new Integer(4830), new MeshInfo(4830, "八代", 2, -110436.011, -94474.586, -36959.599,
				0.000));
		map.put(new Integer(4831), new MeshInfo(4831, "延岡", 2, -110872.928, 0.000, -36517.827,
				93784.508));
		map.put(new Integer(4930), new MeshInfo(4930, "熊本", 2, -36517.827, -93784.508, 36961.570,
				0.000));
		map.put(new Integer(4931), new MeshInfo(4931, "大分", 2, -36959.599, 0.000, 37407.958,
				93081.720));
		map.put(new Integer(5030), new MeshInfo(5030, "福岡", 2, 37407.958, -93081.720, 110890.661,
				0.000));
		map.put(new Integer(5031), new MeshInfo(5031, "中津", 2, 36961.570, 0.000, 111341.425,
				92366.314));
		map.put(new Integer(5130), new MeshInfo(5130, "小串", 2, 111341.425, -92366.314, 184827.754,
				0.000));
		map.put(new Integer(5131), new MeshInfo(5131, "山口", 3, -221222.021, -107761.446,
				-147885.850, -15272.795));
		map.put(new Integer(5132), new MeshInfo(5132, "広島", 3, -221823.058, -15394.099,
				-147582.593, 76364.898));
		map.put(new Integer(5231), new MeshInfo(5231, "見島", 3, -147279.304, -106912.145,
				-73940.573, -15149.421));
		map.put(new Integer(5232), new MeshInfo(5232, "浜田", 3, -147885.850, -15272.795, -73634.725,
				75747.959));
		map.put(new Integer(5332), new MeshInfo(5332, "大社", 3, -73940.573, -15149.421, 321.116,
				75120.744));
		map.put(new Integer(5432), new MeshInfo(5432, "西郷", 3, 12.844, -15023.990, 74284.997,
				74483.333));
		map.put(new Integer(4932), new MeshInfo(4932, "宇和島", 4, -35965.508, -140680.518, 37073.160,
				-46540.153));
		map.put(new Integer(4933), new MeshInfo(4933, "窪川", 4, -36849.163, -46891.503, 37073.160,
				46540.153));
		map.put(new Integer(4934), new MeshInfo(4934, "剣山", 4, -36849.163, 46891.503, 37966.047,
				139626.119));
		map.put(new Integer(5032), new MeshInfo(5032, "松山", 4, 37966.047, -139626.119, 111003.345,
				-46182.493));
		map.put(new Integer(5033), new MeshInfo(5033, "高知", 4, 37073.160, -46540.153, 111003.345,
				46182.493));
		map.put(new Integer(5034), new MeshInfo(5034, "剣山", 4, 37073.160, 46540.153, 111904.981,
				138552.792));
		map.put(new Integer(5134), new MeshInfo(5134, "徳島", 4, 111003.345, 46182.493, 185851.369,
				137460.679));
		map.put(new Integer(5133), new MeshInfo(5133, "岡山及丸亀", 5, -221034.170, -123156.922,
				-147847.945, -30545.637));
		map.put(new Integer(5233), new MeshInfo(5233, "高梁", 5, -147089.733, -122186.228,
				-73902.343, -30298.884));
		map.put(new Integer(5234), new MeshInfo(5234, "姫路", 5, -147847.945, -30545.637, -73749.422,
				60598.111));
		map.put(new Integer(5333), new MeshInfo(5333, "松江", 5, -73137.657, -121198.961, 51.376,
				-30048.020));
		map.put(new Integer(5334), new MeshInfo(5334, "鳥取", 5, -73902.343, -30298.884, 205.511,
				60096.357));
		map.put(new Integer(5433), new MeshInfo(5433, "西郷", 5, 822.125, -120195.252, 74013.281,
				-29793.078));
		map.put(new Integer(5035), new MeshInfo(5035, "田辺", 6, -295318.281, -93081.720,
				-221835.578, 0.000));
		map.put(new Integer(5036), new MeshInfo(5036, "木本", 6, -295764.669, 0.000, -221384.814,
				92366.314));
		map.put(new Integer(5135), new MeshInfo(5135, "和歌山", 6, -221384.814, -92366.314,
				-147898.485, 0.000));
		map.put(new Integer(5136), new MeshInfo(5136, "伊勢", 6, -221835.578, 0.000, -147443.590,
				91638.383));
		map.put(new Integer(5235), new MeshInfo(5235, "京都及大阪", 6, -147443.590, -91638.383,
				-73953.316, 0.000));
		map.put(new Integer(5335),
				new MeshInfo(5335, "宮津", 6, -73494.535, -90898.022, 0.000, 0.000));
		map.put(new Integer(5435), new MeshInfo(5435, "金沢", 6, 462.418, -90145.329, 73961.528,
				0.000));
		map.put(new Integer(5137), new MeshInfo(5137, "伊良湖岬", 7, -221823.058, -15394.099,
				-147582.593, 76364.898));
		map.put(new Integer(5236), new MeshInfo(5236, "名古屋", 7, -147279.304, -106912.145,
				-73940.573, -15149.421));
		map.put(new Integer(5237), new MeshInfo(5237, "豊橋", 7, -147885.850, -15272.795, -73634.725,
				75747.959));
		map.put(new Integer(5336), new MeshInfo(5336, "岐阜", 7, -73328.847, -106048.342, 12.844,
				-15023.990));
		map.put(new Integer(5337), new MeshInfo(5337, "飯田", 7, -73940.573, -15149.421, 321.116,
				75120.744));
		map.put(new Integer(5436), new MeshInfo(5436, "金沢", 7, 629.420, -105170.151, 73974.466,
				-14896.521));
		map.put(new Integer(5437), new MeshInfo(5437, "高山", 7, 12.844, -15023.990, 74284.997,
				74483.333));
		map.put(new Integer(5536), new MeshInfo(5536, "七尾", 7, 74595.558, -104277.688, 147944.355,
				-14767.029));
		map.put(new Integer(5537), new MeshInfo(5537, "富山", 7, 73974.466, -14896.521, 148256.976,
				73835.811));
		map.put(new Integer(5636), new MeshInfo(5636, "輪島", 7, 148569.627, -103371.069, 221922.567,
				-14635.531));
		map.put(new Integer(5637), new MeshInfo(5637, "輪島", 7, 147944.355, -14767.029, 222237.109,
				73178.261));
		map.put(new Integer(5138), new MeshInfo(5138, "御前崎", 8, -221722.894, -46182.493,
				-147784.768, 45818.571));
		map.put(new Integer(5238), new MeshInfo(5238, "静岡", 8, -147784.768, -45818.571, -73838.627,
				45448.433));
		map.put(new Integer(5338), new MeshInfo(5338, "甲府", 8, -73838.627, -45448.433, 115.598,
				45072.129));
		map.put(new Integer(5438), new MeshInfo(5438, "長野", 8, 115.598, -45072.129, 74077.973,
				44689.708));
		map.put(new Integer(5538), new MeshInfo(5538, "高田", 8, 74077.973, -44689.708, 148048.558,
				44301.219));
		map.put(new Integer(5638), new MeshInfo(5638, "長岡", 8, 148048.558, -44301.219, 222027.411,
				43906.715));
		map.put(new Integer(5639), new MeshInfo(5639, "新潟", 8, 148048.558, 44301.219, 222971.156,
				131723.413));
		map.put(new Integer(5738), new MeshInfo(5738, "相川", 8, 222027.411, -43906.715, 296014.583,
				43506.245));
		map.put(new Integer(5739), new MeshInfo(5739, "村上", 8, 222027.411, 43906.715, 296963.579,
				130521.674));
		map.put(new Integer(4540), new MeshInfo(4540, "小笠原諸島", 9, -665281.316, 16077.545,
				-590822.124, 111786.618));
		map.put(new Integer(4740), new MeshInfo(4740, "須美寿島", 9, -517492.749, 15858.282,
				-443004.456, 110221.243));
		map.put(new Integer(4839), new MeshInfo(4839, "八丈島", 9, -443295.760, -78728.282,
				-369673.568, 15630.427));
		map.put(new Integer(4939), new MeshInfo(4939, "八丈島", 9, -369379.059, -78153.247,
				-295752.271, 15513.314));
		map.put(new Integer(5039), new MeshInfo(5039, "御蔵島", 9, -295454.685, -77567.620,
				-221823.058, 15394.099));
		map.put(new Integer(5139), new MeshInfo(5139, "三宅島", 9, -221522.555, -76971.477,
				-147885.850, 15272.795));
		map.put(new Integer(5239), new MeshInfo(5239, "横須賀", 9, -147582.593, -76364.898,
				-73940.573, 15149.421));
		map.put(new Integer(5240), new MeshInfo(5240, "大多喜", 9, -147885.850, 15272.795, -73328.847,
				106048.342));
		map.put(new Integer(5339), new MeshInfo(5339, "東京", 9, -73634.725, -75747.959, 12.844,
				15023.990));
		map.put(new Integer(5340), new MeshInfo(5340, "千葉", 9, -73940.573, 15149.421, 629.420,
				105170.151));
		map.put(new Integer(5439), new MeshInfo(5439, "宇都宮", 9, 321.116, -75120.744, 73974.466,
				14896.521));
		map.put(new Integer(5440), new MeshInfo(5440, "水戸", 9, 12.844, 15023.990, 74595.558,
				104277.688));
		map.put(new Integer(5539), new MeshInfo(5539, "日光", 9, 74284.997, -74483.333, 147944.355,
				14767.029));
		map.put(new Integer(5540), new MeshInfo(5540, "白河", 9, 73974.466, 14896.521, 148569.627,
				103371.069));
		map.put(new Integer(5541), new MeshInfo(5541, "白河", 9, 74595.558, 104277.688, 149234.109,
				147675.792));
		map.put(new Integer(5640), new MeshInfo(5640, "福島", 9, 147944.355, 14767.029, 222551.681,
				102450.414));
		map.put(new Integer(5641), new MeshInfo(5641, "福島", 9, 148569.627, 103371.069, 223220.244,
				146360.306));
		map.put(new Integer(5740), new MeshInfo(5740, "仙台", 10, -221657.233, -73178.261,
				-147985.188, 14502.046));
		map.put(new Integer(5741), new MeshInfo(5741, "石巻", 10, -221971.776, 14635.531,
				-147352.572, 101515.842));
		map.put(new Integer(5839), new MeshInfo(5839, "酒田", 10, -147154.855, -116018.649,
				-73672.302, -71833.430));
		map.put(new Integer(5840), new MeshInfo(5840, "新庄", 10, -147668.894, -72510.772,
				-73990.176, 14366.589));
		map.put(new Integer(5841), new MeshInfo(5841, "一関", 10, -147985.188, 14502.046, -73354.400,
				100567.478));
		map.put(new Integer(5939), new MeshInfo(5939, "男鹿", 10, -73155.697, -114934.744, 332.585,
				-71146.324));
		map.put(new Integer(5940), new MeshInfo(5940, "秋田", 10, -73672.302, -71833.430, 13.303,
				14229.180));
		map.put(new Integer(5941), new MeshInfo(5941, "盛岡", 10, -73990.176, 14366.589, 651.895,
				99605.447));
		map.put(new Integer(5942), new MeshInfo(5942, "盛岡", 10, -73354.400, 100567.478, 1330.519,
				142295.294));
		map.put(new Integer(6039), new MeshInfo(6039, "深浦", 10, 851.477, -113835.220, 74345.806,
				-70449.545));
		map.put(new Integer(6040), new MeshInfo(6040, "弘前", 10, 332.585, -71146.324, 74025.288,
				14089.836));
		map.put(new Integer(6041), new MeshInfo(6041, "八戸", 10, 13.303, 14229.180, 74666.350,
				98629.874));
		map.put(new Integer(6139), new MeshInfo(6139, "青森", 10, 75628.145, -154992.205, 148367.393,
				-69743.186));
		map.put(new Integer(6140), new MeshInfo(6140, "青森", 10, 74345.806, -70449.545, 148045.813,
				13948.576));
		map.put(new Integer(6141), new MeshInfo(6141, "野辺地", 10, 74025.288, 14089.836, 148688.999,
				97640.889));
		map.put(new Integer(6239), new MeshInfo(6239, "渡島大島", 11, -295414.182, -104615.377,
				-222108.635, -20708.131));
		map.put(new Integer(6240), new MeshInfo(6240, "函館", 11, -296137.777, -20922.869,
				-221866.786, 62124.560));
		map.put(new Integer(6241), new MeshInfo(6241, "尻屋崎", 11, -295896.593, 62768.813,
				-220657.324, 144959.265));
		map.put(new Integer(6339), new MeshInfo(6339, "久遠", 11, -221383.044, -103541.493,
				-148070.907, -20490.575));
		map.put(new Integer(6340), new MeshInfo(6340, "室蘭", 11, -222108.635, -20708.131,
				-147828.523, 61471.854));
		map.put(new Integer(6439), new MeshInfo(6439, "岩内", 11, -147343.712, -102453.522,
				-74024.574, -20270.229));
		map.put(new Integer(6440), new MeshInfo(6440, "岩内", 11, -148070.907, -20490.575,
				-73781.785, 60810.779));
		map.put(new Integer(6540), new MeshInfo(6540, "岩内", 11, -74024.574, -20270.229, 273.443,
				60141.424));
		map.put(new Integer(6341), new MeshInfo(6341, "苫小牧", 12, -221383.044, -103541.493,
				-148070.907, -20490.575));
		map.put(new Integer(6342), new MeshInfo(6342, "浦河", 12, -222108.635, -20708.131,
				-147828.523, 61471.854));
		map.put(new Integer(6441), new MeshInfo(6441, "札幌", 12, -147343.712, -102453.522,
				-74024.574, -20270.229));
		map.put(new Integer(6442), new MeshInfo(6442, "夕張岳", 12, -148070.907, -20490.575,
				-73781.785, 60810.779));
		map.put(new Integer(6541), new MeshInfo(6541, "留萌", 12, -73296.168, -101351.607, 30.382,
				-20047.123));
		map.put(new Integer(6542), new MeshInfo(6542, "旭川", 12, -74024.574, -20270.229, 273.443,
				60141.424));
		map.put(new Integer(6641), new MeshInfo(6641, "羽幌", 12, 759.604, -100235.893, 74093.970,
				-19821.286));
		map.put(new Integer(6642), new MeshInfo(6642, "名寄", 12, 30.382, -20047.123, 74337.172,
				59463.877));
		map.put(new Integer(6643), new MeshInfo(6643, "紋別", 12, 273.443, 60141.424, 75553.371,
				138749.279));
		map.put(new Integer(6741), new MeshInfo(6741, "天塩", 12, 74823.614, -99106.529, 148166.198,
				-19592.748));
		map.put(new Integer(6742), new MeshInfo(6742, "枝幸", 12, 74093.970, -19821.286, 148409.409,
				58778.229));
		map.put(new Integer(6840), new MeshInfo(6840, "稚内", 12, 149625.648, -137149.023,
				222976.368, -96807.451));
		map.put(new Integer(6841), new MeshInfo(6841, "稚内", 12, 148895.868, -97963.664, 222247.067,
				-19361.539));
		map.put(new Integer(6842), new MeshInfo(6842, "稚内", 12, 148166.198, -19592.748, 222490.155,
				58084.569));
		map.put(new Integer(6243), new MeshInfo(6243, "広尾", 13, -295414.182, -104615.377,
				-222108.635, -20708.131));
		map.put(new Integer(6343), new MeshInfo(6343, "広尾", 13, -221383.044, -103541.493,
				-148070.907, -20490.575));
		map.put(new Integer(6443), new MeshInfo(6443, "帯広", 13, -147343.712, -102453.522,
				-74024.574, -20270.229));
		map.put(new Integer(6444), new MeshInfo(6444, "釧路", 13, -148070.907, -20490.575,
				-73781.785, 60810.779));
		map.put(new Integer(6445), new MeshInfo(6445, "根室", 13, -147828.523, 61471.854, -72567.640,
				141892.896));
		map.put(new Integer(6543), new MeshInfo(6543, "北見", 13, -73296.168, -101351.607, 30.382,
				-20047.123));
		map.put(new Integer(6544), new MeshInfo(6544, "斜里", 13, -74024.574, -20270.229, 273.443,
				60141.424));
		map.put(new Integer(6545), new MeshInfo(6545, "標津", 13, -73781.785, 60810.779, 1488.944,
				140330.640));
		map.put(new Integer(6546), new MeshInfo(6546, "色丹島", 13, 0.0, 0.0, 0.0, 0.0));
		map.put(new Integer(6644), new MeshInfo(6644, "網走", 13, 30.382, -20047.123, 74337.172,
				59463.877));
		map.put(new Integer(6645), new MeshInfo(6645, "知床岬", 13, 273.443, 60141.424, 75553.371,
				138749.279));
		map.put(new Integer(6646), new MeshInfo(6646, "安渡移矢岬", 13, 0.0, 0.0, 0.0, 0.0));
		map.put(new Integer(6647), new MeshInfo(6647, "得紋別岬", 13, 0.0, 0.0, 0.0, 0.0));
		map.put(new Integer(6747), new MeshInfo(6747, "紗那", 13, 0.0, 0.0, 0.0, 0.0));
		map.put(new Integer(6748), new MeshInfo(6748, "別飛", 13, 0.0, 0.0, 0.0, 0.0));
		map.put(new Integer(6847), new MeshInfo(6847, "蘂取", 13, 0.0, 0.0, 0.0, 0.0));
		map.put(new Integer(6848), new MeshInfo(6848, "蘂取", 13, 0.0, 0.0, 0.0, 0.0));
		map.put(new Integer(3641), new MeshInfo(3641, "小笠原諸島", 14, -221140.219, -101733.110,
				-147674.134, 0.000));
		map.put(new Integer(3741), new MeshInfo(3741, "小笠原諸島", 14, -147305.535, -101202.073,
				-73840.398, 0.000));
		map.put(new Integer(3841), new MeshInfo(3841, "小笠原諸島", 14, -73464.519, -100657.363, 0.000,
				0.000));
		map.put(new Integer(3942), new MeshInfo(3942, "小笠原諸島", 14, 0.000, 0.000, 74237.010,
				99527.204));
		map.put(new Integer(4040), new MeshInfo(4040, "小笠原諸島", 14, 74724.398, -149296.504,
				148097.763, -98941.902));
		map.put(new Integer(4042), new MeshInfo(4042, "小笠原諸島", 14, 73847.184, 0.000, 148097.763,
				98941.902));
		map.put(new Integer(4142), new MeshInfo(4142, "小笠原諸島", 14, 147701.278, 0.000, 221965.331,
				98343.218));
		map.put(new Integer(3926), new MeshInfo(3926, "久米島", 15, 861.756, -150154.482, 73944.634,
				-49762.462));
		map.put(new Integer(3927), new MeshInfo(3927, "那覇", 15, 95.732, -50048.343, 73944.634,
				49762.462));
		map.put(new Integer(3928), new MeshInfo(3928, "那覇", 15, 95.732, 50048.343, 74724.398,
				149296.504));
		map.put(new Integer(4027), new MeshInfo(4027, "与論島", 15, 73944.634, -49762.462, 147800.392,
				49469.854));
		map.put(new Integer(4028), new MeshInfo(4028, "与論島", 15, 73944.634, 49762.462, 148593.476,
				148418.339));
		map.put(new Integer(3622), new MeshInfo(3622, "石垣島", 16, -220688.714, -152606.190,
				-147305.535, -101202.073));
		map.put(new Integer(3623), new MeshInfo(3623, "石垣島", 16, -221140.219, -101733.110,
				-147674.134, 0.000));
		map.put(new Integer(3624), new MeshInfo(3624, "石垣島", 16, -221501.340, 0.000, -147305.535,
				101202.073));
		map.put(new Integer(3724), new MeshInfo(3724, "宮古島", 16, -147674.134, 0.000, -73464.519,
				100657.363));
		map.put(new Integer(3725), new MeshInfo(3725, "宮古島", 16, -147305.535, 101202.073,
				-72994.564, 150992.161));
		map.put(new Integer(3823), new MeshInfo(3823, "魚釣島", 16, -73464.519, -100657.363, 0.000,
				0.000));
		map.put(new Integer(3824), new MeshInfo(3824, "魚釣島", 16, -73840.398, 0.000, 382.956,
				100099.049));
		map.put(new Integer(3631), new MeshInfo(3631, "那覇", 17, -221501.340, 0.000, -147305.535,
				101202.073));
		map.put(new Integer(3831), new MeshInfo(3831, "那覇", 17, -73840.398, 0.000, 382.956,
				100099.049));
		map.put(new Integer(3036), new MeshInfo(3036, "沖ノ鳥島", 18, 0.000, 0.000, 74111.825,
				104180.844));
		map.put(new Integer(3653), new MeshInfo(3653, "小笠原諸島", 19, -221140.219, -101733.110,
				-147674.134, 0.000));
	};
}
